# Dta Sorting And Conditions

## Orders

In [2]:
# syntax : 
"""
    SQL order by in either ascending or descending order 
    in ascending order by default.
    
    select columns1,columns2, columns3, ...
    From table_name
    order by columns1,columns2, columns3, ...
    """

'\n    SQL order by in either ascending or descending order \n    in ascending order by default.\n    \n    select columns1,columns2, columns3, ...\n    From table_name\n    order by columns1,columns2, columns3, ...\n    '

# Hands-on order by

In [ ]:
CREATE TABLE fruits(
  fruit_id serial PRIMARY KEY,
  fruit_name VARCHAR(50) not NULL,
  fruit_code VARCHAR(10) NOT NULL
 );SELECT *
FROM players01
ORDER BY first_name;

In [ ]:
SELECT *
FROM players01
ORDER BY first_name ASC;

In [ ]:
SELECT *
FROM players01
ORDER BY first_name DESC;

In [ ]:
SELECT *
FROM players01
ORDER BY first_name,team DESC

# Union

In [3]:
# SQL Union  and Union all: 
""" 
select records
from two omore table(two or more select statements)
select only distinct values by default.

The columns must also have similar data types and the same order.


Syntax : 
select column_name(s) from table1
Union
select column_name(s) from table2


union all select all to duplicate values

Syntax : 
select column_name(s) from table1
Union All
select column_name(s) from table2
"""

' \nselect records\nfrom two omore table(two or more select statements)\nselect only distinct values by default.\n\nThe columns must also have similar data types and the same order.\n\n\nSyntax : \nselect column_name(s) from table1\nUnion\nselect column_name(s) from table2\n\n\nunion all select all to duplicate values\n\nSyntax : \nselect column_name(s) from table1\nUnion All\nselect column_name(s) from table2\n'

In [ ]:
SELECT employee_id AS union_employee
from employees
UNION
SELECT player_id
FROM players01;

In [ ]:
SELECT employee_id AS union_employee
from employees
UNION ALL
SELECT player_id
FROM players01;

# Any and All

# Any

In [ ]:
SELECT *
from players01
WHERE player_id = ANY(
  SELECT employee_id
  from employees
  );

# All

In [ ]:
SELECT all first_name
FROM players01
WHERE TRUE;

In [ ]:
SELECT all last_name
FROM players01
WHERE TRUE;

# All With two tables exemple 2 Hands-on

In [ ]:
SELECT all last_name
FROM players01
WHERE player_id = 3;

In [ ]:
SELECT first_name
from players01
where player_id > all(
  SELECT employee_id
  from employees
  WHERE employee_id = 7
  );

In [ ]:
SELECT player_id, first_name
from players01
where player_id > all(
  SELECT employee_id
  from employees
  WHERE employee_id = 7
  );

In [ ]:
SELECT player_id, first_name
from players01
where player_id <all(
  SELECT employee_id
  from employees
  WHERE employee_id = 7
  );

In [ ]:
 SELECT player_id, first_name
from players01
where player_id = all(
  SELECT employee_id
  from employees
  WHERE employee_id = 7
  );

# Group By

# Hands on group by

In [ ]:
SELECT team, COUNT(*) as T_number
  from players01
  GROUP by team;

In [ ]:
 SELECT team, min(rating) as min_rating
  from players01
  GROUP BY team;

In [ ]:
SELECT team, MAX(rating) as max_rating
  from players01
  GROUP BY team;

# Having Clause

# Use having clause to filter data hands-on

In [ ]:
SELECT player_id,rating
FROM players01
GROUP by player_id, rating
HAVING rating > 90;

In [ ]:
SELECT player_id,rating
FROM players01
GROUP by player_id, rating
HAVING rating < 90;

In [ ]:
SELECT COUNT(player_id), team
FROM players01
GROUP by team
HAVING COUNT(player_id) > 1;

# Hands -on LIKE and Wildcards

In [ ]:
SELECT * from players01
WHERE first_name LIKE 'M%';

In [ ]:
SELECT * from players01
WHERE first_name LIKE '%a%';

In [ ]:

SELECT * from players01
WHERE first_name LIKE '%d';

In [ ]:
SELECT * from players01
WHERE first_name LIKE '_o%';

In [ ]:
SELECT * from players01
WHERE first_name LIKE '_o%';

# Case Statement

In [ ]:

SELECT player_id,rating,
Case 
	When rating > 90 THEN  'Excellent rating'
    When rating =  90 THEN 'Very Good rating'
    ELSE 'Good rating!!'
End AS rate_notes
FROM players01;